13/data/attachments/a0ade3d3190c48bb.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_a60f3bfe-14c3-416c-bec0-18aa7960c8ea</nif:username>
            <nif:friendToBeAdded>Arthur_billion_Friend_43296_0</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>